SM_для_EDT/src/Catalogs/рарусРасходТМЦПрисоединенныеФайлы/рарусРасходТМЦПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рарусРасходТМЦПрисоединенныеФайлы</name>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>DocumentRef.рарусРасходТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске (в случае если Тип хранения файла - на диске)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <comment>Размер файла</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <comment>Где хранятся файлы - в базе как Хранилище значения или в каталоге на диске</comment>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <comment>Ссылка на том (в случае если Тип хранения файла - на диске)</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <comment>Служебное поле для обмена файлами в распределенной информационной базе</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьЭлектронныеПодписи</name>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыданСертификат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <comment>Отпечаток сертификата</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановившийПодпись</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроверкиПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписьВерна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьСертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SM_для_EDT/src/Enums/рарусВидыОперацийРасходаТМЦ/рарусВидыОперацийРасходаТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рарусВидыОперацийРасходаТМЦ</name>
  <comment>rarus makole ФТ.ИМ.01.01</comment>
  <enumValues>
    <name>СоСклада</name>
  </enumValues>
  <enumValues>
    <name>ИзВыданного</name>
  </enumValues>
  <enumValues>
    <name>БУ</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Documents/рарусРасходТМЦ/рарусРасходТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>рарусРасходТМЦ</name>
  <comment>rarus makole</comment>
  <basedOn>Document.рарусИнвентаризацияТМЦ</basedOn>
  <basedOn>Document.рарусИзменениеСтатусаТМЦ</basedOn>
  <basedOn>Document.рарусЗаказКлиента</basedOn>
  <basedOn>Document.рарусЗаказНаПеремещение</basedOn>
  <registerRecords>AccumulationRegister.рарусТоварыКОтгрузке</registerRecords>
  <registerRecords>AccumulationRegister.рарусИмуществоНаСудах</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.рарусВидыОперацийРасходаТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.впАктОВыполненииЭтапаРабот</types>
      <types>DocumentRef.рарусЗаказНаПеремещение</types>
      <types>DocumentRef.рарусЗаказКлиента</types>
      <types>DocumentRef.рарусИнвентаризацияТМЦ</types>
      <types>DocumentRef.впПриходТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>СформированСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТМЦ</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Catalogs/рарусКатегорииНоменклатуры/рарусКатегорииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рарусКатегорииНоменклатуры</name>
  <comment>rarus makole</comment>
  <predefined>
    <items>
      <name>ИМПАИмущество</name>
      <description>ИМПА/Имущество</description>
    </items>
    <items>
      <name>ИМПАРасходныеМатериалы</name>
      <description>ИМПА/Расходные Материалы</description>
    </items>
    <items>
      <name>КартыИПубликации</name>
      <description>Карты и публикации</description>
    </items>
    <items>
      <name>Колпит</name>
      <description>Колпит</description>
    </items>
    <items>
      <name>СЗЧ</name>
      <description>СЗЧ (Сменные запасные части)</description>
    </items>
    <items>
      <name>СИЗИ</name>
      <description>СИЗ (Средства индивидуальной защиты) индивидуального пользования</description>
    </items>
    <items>
      <name>СИЗО</name>
      <description>СИЗ (Средства индивидуальной защиты) общего пользования</description>
    </items>
    <items>
      <name>СудоваяКраска</name>
      <description>Судовая краска</description>
    </items>
    <items>
      <name>СудоваяХимияПромышленныеГазы</name>
      <description>Судовая химия / Промышлененные газы</description>
    </items>
    <items>
      <name>ШвартовныеКонцыСтальныеТроса</name>
      <description>Швартовные концы / стальные троса</description>
    </items>
  </predefined>
  <attributes>
    <name>ВыдаетсяЭкипажу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

SM_для_EDT/src/Catalogs/рарусРасходТМЦПрисоединенныеФайлы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает реквизиты объекта, которые разрешается редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	Возврат РаботаСФайлами.РеквизитыРедактируемыеВГрупповойОбработке();
	
КонецФункции

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	РаботаСФайлами.ОпределитьФормуПрисоединенногоФайла(
			Справочники.рарусРасходТМЦПрисоединенныеФайлы, 
			ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры
#КонецОбласти

#Область РегистрацияКОбмену

// Событие выполняется перед применением правила регистрации, в момент, когда запрос к информационной базе для определения узлов-получателей еще не выполнен.
// Контекст выполнения
// Перед записью объекта; При выгрузке объекта.
//
// Параметры:
// 	Отказ 			– Булево – флаг отказа от выполнения правила регистрации. Отказ от выполнения правила означает, 
// 						что объект не будет зарегистрирован на узлах плана обмена, для которого создано это правило.
// 	Объект 			– СправочникОбъект.рарусРасходТМЦПрисоединенныеФайлы - объект для которого выполняется правило регистрации
// 	ОбъектМетаданных– ОбъектМетаданных - объект метаданных, соответствующий параметру Объект.
// 	Выгрузка  		– Булево – (только чтение) параметр определяет контекст выполнения правила регистрации. 
//						Истина – правило регистрации выполняется в контексте выгрузки объекта. 
//						Ложь – правило регистрации выполняется в контексте перед записью объекта.
// 	ПРО 			– СтрокаТаблицыЗначений – ссылка на правило регистрации объектов
//
Процедура ПередОбработкой(ИмяПланаОбмена, Отказ, Объект, ОбъектМетаданных, Выгрузка, ПРО) Экспорт
	
	ОснованиеВладельца = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВладелецФайла, "ДокументОснование");

	Если ЗначениеЗаполнено(ОснованиеВладельца)
		И (ТипЗнч(ОснованиеВладельца) = Тип("ДокументСсылка.рарусЗаказКлиента")
			ИЛИ ТипЗнч(ОснованиеВладельца) = Тип("ДокументСсылка.рарусЗаказНаПеремещение")) Тогда 
			Отказ = Истина;
			Возврат;
	КонецЕсли;
		
	Если ЕстьНевыгружаемыеКатегории(Объект.ВладелецФайла) Тогда
		Отказ = Истина
	КонецЕсли;

КонецПроцедуры	

#КонецОбласти

#Область ВыгрузкаФайла

// Перед выгрузкой объекта
// Событие выполняется при получении очередного объекта из выборки, до передачи этого объекта правилу конвертации.
//
// Параметры:
// 	Отказ 			- Булево - Если установить значение Истина, то выгрузка объекта производится не будет
// 	Параметры 		- Структура - структура, в которой хранятся переменные доступные во всех обработчиках
// 	ИмяПКО 			- Строка - Имя правила конвертации объектов, указанное по умолчанию в правиле выгрузки данных. При выгрузке конкретных объектов может быть изменено
// 	Правило 		- СтрокаТаблицыЗначений - ссылка на данное правило выгрузки данных
// 	ВходящиеДанные 	- Произвольный - произвольные вспомогательные данные, инициализированные в обработчике «Перед обработкой» правила выгрузки данных как ИсходящиеДанные.
// 	ИсходящиеДанные – Произвольный - произвольные вспомогательные данные, передаваемые правилу конвертации объекта. 
//					В обработчиках ПКО данная информация будет доступна как переменная ВходящиеДанные
// 	Объект 			- СправочникОбъект.рарусРасходТМЦПрисоединенныеФайлы - Выгружаемый объект. Может быть переопределен или назначен непосредственно в обработчике.
//     	
Процедура ПередВыгрузкой(Отказ, Параметры, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт
	
	КатегорииДокумента = КатегорииДокумента(Объект.ВладелецФайла);
	
	Если КатегорииДокумента <> Неопределено Тогда
		
		ВидОперации = КатегорииДокумента[0].ВидОперации;
		Если ВидОперации = ПредопределенноеЗначение("Перечисление.рарусВидыОперацийРасходаТМЦ.ИзВыданного") Тогда
		    ИмяПКО = "РасходТМЦ_CписаниеИзЭксплуатац_ПрисоединенныеФайлы"
		ИначеЕсли КатегорииДокумента.Найти(ПредопределенноеЗначение("Справочник.рарусКатегорииНоменклатуры.Колпит"), "Категория") <> Неопределено  
			ИЛИ (ПолучитьФункциональнуюОпцию("рарусУчетКартНавигацииКакУслуги") 
			И КатегорииДокумента.Найти(ПредопределенноеЗначение("Справочник.рарусКатегорииНоменклатуры.КартыИПубликации"), "Категория") <> Неопределено) Тогда
			Отказ = Истина
		Иначе
			ИмяПКО = "РасходТМЦ_ВнутреннееПотрТов_ПрисоединенныеФайлы"
		КонецЕсли;
	Иначе
		Отказ = Истина
	КонецЕсли;
		
КонецПроцедуры	

#КонецОбласти

Функция ЕстьНевыгружаемыеКатегории(Ссылка)
	
	РезультатФункции = Ложь;
	
	ИсключаемыеКатегории = Новый Массив;
	ИсключаемыеКатегории.Добавить(ПредопределенноеЗначение("Справочник.рарусКатегорииНоменклатуры.Колпит"));
	Если ПолучитьФункциональнуюОпцию("рарусУчетКартНавигацииКакУслуги") Тогда
		ИсключаемыеКатегории.Добавить(ПредопределенноеЗначение("Справочник.рарусКатегорииНоменклатуры.КартыИПубликации"))
	КонецЕсли;
	
	Запрос = Новый Запрос;

	//Установка значений параметров
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ИсключаемыеКатегории", ИсключаемыеКатегории);

	Запрос.Текст = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(рарусРасходТМЦТМЦ.Номенклатура) КАК КоличествоСтрок
	|ИЗ
	|	Документ.рарусРасходТМЦ.ТМЦ КАК рарусРасходТМЦТМЦ
	|ГДЕ
	|	рарусРасходТМЦТМЦ.Номенклатура.Категория В (&ИсключаемыеКатегории)
	|	И рарусРасходТМЦТМЦ.Ссылка = &Ссылка";

	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаИсключаемые = РезультатЗапроса.Выбрать();
		ВыборкаИсключаемые.Следующий();
		РезультатФункции = ВыборкаИсключаемые.КоличествоСтрок > 0;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция КатегорииДокумента(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	рарусРасходТМЦТМЦ.Ссылка.ВидОперации КАК ВидОперации,
		|	ЕСТЬNULL(рарусКатегорииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.рарусКатегорииНоменклатуры.ПустаяСсылка)) КАК Категория
		|ИЗ
		|	Документ.рарусРасходТМЦ.ТМЦ КАК рарусРасходТМЦТМЦ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.рарусКатегорииНоменклатуры КАК рарусКатегорииНоменклатуры
		|		ПО рарусРасходТМЦТМЦ.Номенклатура.Категория = рарусКатегорииНоменклатуры.Ссылка
		|ГДЕ
		|	рарусРасходТМЦТМЦ.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат РезультатЗапроса.Выгрузить()
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

// ++ rarus makole 2020-12-04 [БСО.ПРОТОКОЛ Р-58 03.12.2020]
// Функция возвращает связанную с объектом информацию, обязательную к выгрузке
//
// Параметры:
//  СсылкаНаОбъект  - СправочникСсылка.впПриходТМЦПрисоединенныеФайлы - ссылка на объект, связанные объекты которого требуется вернуть
//
// Возвращаемое значение:
//   Массив   - Массив структур с ключами "ИмяТипа, Отбор", где ИмяТипа - Строка, представляет полное имя
//				объекта метаданных, Отбор - структура с ключами, соответствующими основному отбору
//
Функция СвязанныеДанные(СсылкаНаОбъект) Экспорт
	
	МассивСвязанных = Новый Массив;
	
	СтруктураОтбора = Новый Структура("Файл", СсылкаНаОбъект);
	СтруктураСведения = Новый Структура("ИмяТипа, Отбор", "РегистрСведений.СведенияОФайлах", СтруктураОтбора);
	МассивСвязанных.Добавить(СтруктураСведения);
	  
	СтруктураОтбора = Новый Структура("ОбъектСФайлами", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект,"ВладелецФайла"));
	СтруктураНаличие = Новый Структура("ИмяТипа, Отбор", "РегистрСведений.НаличиеФайлов", СтруктураОтбора);
	МассивСвязанных.Добавить(СтруктураНаличие);
	  
	Возврат МассивСвязанных;
	  
КонецФункции // -- rarus makole 2020-12-04 [БСО.ПРОТОКОЛ Р-58 03.12.2020]

#КонецЕсли
